In [1]:
import pandas as pd

In [7]:
list1 = [[1,6,3,8,5]]
df = pd.DataFrame(list1, columns = [1,2,3,4,5])
df

   1  2  3  4  5
0  1  6  3  8  5

In [3]:
import numpy as np

In [31]:
a = np.argsort(df)[::-1]
a

   1  2  3  4  5
0  0  2  4  1  3

In [32]:
a = a[a<=2]
a

   1  2   3  4   5
0  0  2 NaN  1 NaN

In [33]:
a = a.dropna(axis=1)
a

   1  2  4
0  0  2  1

In [38]:
a.columns.values

array([1, 2, 4])

In [41]:
list2 = [[1,6,3,8,5],[7,6,3,8,9]]
df = pd.DataFrame(list2, columns = [1,2,3,4,5])
df

   1  2  3  4  5
0  1  6  3  8  5
1  7  6  3  8  9

In [42]:
df = df.apply(np.argsort, axis = 1)
df

   1  2  3  4  5
0  0  2  4  1  3
1  2  1  0  3  4

In [45]:
a = df.dropna(axis = 0)
a

   1  2  3  4  5
0  0  2  4  1  3
1  2  1  0  3  4